<a href="https://colab.research.google.com/github/alex-cailler/alexandre-wordpress/blob/master/Copie_de_tp1_prepa_feature.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Import des librairies ##

In [ ]:
#Imports librairies de base
import numpy as np
import pandas as pd

#Bibliothèques pour Cross validation

#Affichage de Graphes
from IPython.display import Markdown, display, HTML

## 1. Lecture des données ##

1.1 Charger les données d'apprentissage (Data/passagers.csv) dans un DataFrame nommé train. Afficher 10 exemples.

In [ ]:
train = pd.read_csv('Data/passagers.csv', dtype={'PassengerId': np.int})

train.sample(10)

     PassengerId  Survived  Pclass  ...      Fare  Cabin  Embarked
331          332         0       1  ...   28.5000   C124         S
834          835         0       3  ...    8.3000    NaN         S
866          867         1       2  ...   13.8583    NaN         C
345          346         1       2  ...   13.0000    F33         S
581          582         1       1  ...  110.8833    C68         C
128          129         1       3  ...   22.3583  F E69         C
396          397         0       3  ...    7.8542    NaN         S
544          545         0       1  ...  106.4250    C86         C
131          132         0       3  ...    7.0500    NaN         S
557          558         0       1  ...  227.5250    NaN         C

[10 rows x 12 columns]

1.2 Charger les données d'apprentissage (Data/test.csv) dans un Dataframe nommé test. Afficher 10 exemples.

In [ ]:
test = pd.read_csv('Data/test.csv', dtype={'PassengerId': np.int})

In [ ]:
test.sample(10)

     PassengerId  Pclass  ... Cabin Embarked
46           938       1  ...    A9        C
361         1253       2  ...   NaN        C
212         1104       2  ...   NaN        S
149         1041       2  ...   NaN        S
282         1174       3  ...   NaN        Q
180         1072       2  ...   NaN        S
252         1144       1  ...   C89        C
254         1146       3  ...   NaN        S
187         1079       3  ...   NaN        S
104          996       3  ...   NaN        C

[10 rows x 11 columns]

1.3 Afficher les informations des deux DataFrames train et Test.

In [ ]:
test.info
train.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

1.4 Calculer le taux global de survie

In [ ]:
train["Survived"].mean()

0.3838383838383838

FamilySize
1     537
2     161
3     102
4      29
5      15
6      22
7      12
8       6
11      7
Name: PassengerId, dtype: int64

#### Question 1 : Quel Travail voyez-vous pour que les données soient prêtes à faire tourner dans un modèle ?




#### Question 2 : Quelle différence y-a-t'il entre les données train et les données test ? 

La différence est que dans les données de test il n'y a pas de donnée concernant la survie.



#### Question 3 : Quel est le rôle de ces deux sets de données ?

## 2. Analyse des features

2.1 Analyser l'effet de la variable Classe sur le taux de survie, en affichant le % de survie par classe

In [ ]:
train[['Survived', 'Pclass']].groupby('Pclass').mean()

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

2.2 Analyser l'effet de la variable Genre (Sex) sur le taux de survie, en affichant le % de survie par genre

In [ ]:
train[['Survived', 'Sex']].groupby('Sex').mean()

        Survived
Sex
female  0.742038
male    0.188908

2.3 Calculer une nouvelle colonne FamilySize contenant la taille de la famille, pour les DataFrame train et Test. Afficher pour 10 exemples l'Id du passager, le nom, l'age, le sexe et la taille de la famille.

In [ ]:
train['FamilySize'] = train['Parch'] + train['SibSp'] + 1

2.4 Visualisez le nombre de personnes et le taux de survie par taille de famille.

In [ ]:
train[['Survived', 'PassengerId', 'FamilySize']].groupby('FamilySize') \
       .agg({'PassengerId':'count', 'Survived':'mean'})

            PassengerId  Survived
FamilySize
1                   537  0.303538
2                   161  0.552795
3                   102  0.578431
4                    29  0.724138
5                    15  0.200000
6                    22  0.136364
7                    12  0.333333
8                     6  0.000000
11                    7  0.000000

2.5 Calculer une nouvelle colonne IsAlone indiquant si le passager est seul ou pas, pour les DataFrame train et Test. Afficher pour 10 exemples l'Id du passager, le nom, l'age, le sexe et le status IsAlone.

In [ ]:

train['isAlone'] = train['FamilySize'] == 1
train[['PassengerId', 'Name', 'Sex', 'Age', 'isAlone']].sample(10)

     PassengerId                             Name     Sex   Age  isAlone
392          393     Gustafsson, Mr. Johan Birger    male  28.0    False
157          158                  Corn, Mr. Harry    male  30.0     True
218          219            Bazzani, Miss. Albina  female  32.0     True
688          689  Fischer, Mr. Eberhard Thelander    male  18.0     True
369          370    Aubart, Mme. Leontine Pauline  female  24.0     True
839          840             Marechal, Mr. Pierre    male   NaN     True
111          112             Zabour, Miss. Hileni  female  14.5    False
861          862      Giles, Mr. Frederick Edward    male  21.0    False
137          138      Futrelle, Mr. Jacques Heath    male  37.0    False
711          712               Klaber, Mr. Herman    male   NaN     True

2.6 Visualisez le nombre de personnes et le taux de survie par statut seul ou pas.

In [ ]:
train[['Survived', 'FamilySize', 'PassengerId', 'isAlone']].groupby('isAlone') \
       .agg({'PassengerId':'count', 'Survived':'mean'}) \
       .rename(columns={'PassengerId':'Qty'})

         Qty  Survived
isAlone
False    354  0.505650
True     537  0.303538

### Question 1 : La variable Classe est-elle utile pour prévoir la survie ? Pourquoi ?



### Question 2 : Même question pour la variable Sex 


### Question 3 : Comment traiter les variables liées à la famille du passager ?

## 3. Traitement des données manquantes (à faire sur les données Train et Test)

3.1 La variable "Embarked" possède des valeurs nulles, compléter par la valeur majoritaire (S).

In [ ]:
train['Embarked'].fillna('S')
test['Embarked'].fillna('S')

<bound method DataFrame.fillna of     Embarked
0          S
1          C
2          S
3          S
4          S
..       ...
886        S
887        S
888        S
889        C
890        Q

[891 rows x 1 columns]>

3.2 Afficher l'influence du port d'embarquement sur la Survie

In [ ]:
train[['Embarked','Survived']].groupby(['Embarked']).mean()

          Survived
Embarked
C              168
Q               77
S              644

3.3 La variable "Fare" (prix du ticket) possède des valeurs manquantes. Remplacer ces valeurs par la valeur médiane.

In [ ]:
train[["Fare"]].fillna(train[["Fare"]].median())
test[["Fare"]].fillna(test[["Fare"]].median())

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

3.4 Créer une variable CategoricalFare Découpant la valeur de ticket en 4 catégories de tailles à peu près égales.

In [ ]:
train['CategoricalFare'] = pd.qcut(train['Fare'], 4)
test['CategoricalFare'] = pd.qcut(test['Fare'], 4)

NameError: ignored

3.5 Analyser l'effet de ces catégories de prix de ticket sur la survie.

In [ ]:
train[['CategoricalFare','Survived']].groupby(['CategoricalFare']).mean()

3.6 Combien de valeurs d'Age manquent ? Complète par des valeurs entières aléatoires entre (moyenne - écart type) et (moyenne + écart type).

In [ ]:
import random
train['Age'] = train['Age'].fillna(random.uniform(train['Age'].mean() - train['Age'].std(), train['Age'].mean() + train['Age'].std()))
test['Age'] = test['Age'].fillna(random.uniform(test['Age'].mean() - test['Age'].std(), test['Age'].mean() + test['Age'].std()))

3.7 Créer une variable CategoricalAge Découpant la valeur d'age en 5 catégories égales.

In [ ]:
test['CategoricalAge'] = pd.qcut(test['Age'], 5)
train['CategoricalAge'] = pd.qcut(train['Age'], 5)

3.8 Analyser l'effet de ces catégories d'age sur la survie.

In [ ]:
train[['CategoricalAge','Survived']].groupby(['CategoricalAge']).mean()

### Question 1 : Classer les variables par ordre d'intérêt

## 4 : Traitement de features complexes (Optionnel)

4.1 : Le nom permet de retrouver le titre du passager. Trouver les titres lorsqu'ils existent.

In [ ]:
train['Title']=train['Name'].str.extract(r"(?<=, )(.?)(?=.)")
test['Title']=test['Name'].str.extract(r"(?<=, )(.?)(?=.)")

4.2 : En utilisant la fonction pandas crosstab, afficher pour train le nombre d'occurences par titres (en ligne) et par sexe (en colonne)

In [ ]:
pd.crosstab(
    train['Title'], [train['Title'].count(), train['Sex']], 
)

4.3 : 
Remplacer 'Melle et 'Ms' par 'Miss'
Remplacer 'Mme' par 'Mrs'
Creer une valeur "Rare" pour les autres titres avec moins de 10 occurences.

In [ ]:
train['Title'].replace(['Ms', 'Mlle'], 'Miss')
train['Title'].replace('Mme', 'Miss')

train.loc[train.groupby('Title')['Title'].transform('count').lt(10), 'Title'] = 'Rare' 


test['Title'].replace(['Ms', 'Mlle'], 'Miss')
test['Title'].replace('Mme', 'Miss')

test.loc[test.groupby('Title')['Title'].transform('count').lt(10), 'Title'] = 'Rare'

## 5. Mise en forme des données non numériques

5.1 Attribuer une valeur numérique au Genre. Par exemple 0 pour 'female' et 1 pour 'male'

In [ ]:
train.loc[
    train["Sex"]=='female', # Lignes
                "Sex"
    ]= 0
train.loc[
    train["Sex"]=='male', # Lignes
                "Sex"
    ]= 1

test.loc[
    test["Sex"]=='female', # Lignes
                "Sex"
    ]= 0
test.loc[
    test["Sex"]=='male', # Lignes
                "Sex"
    ]= 1

5.2 : Attribuer une valeur pour les possibilités de la variable "Title" ('Master','Miss','Mr','Mrs','Rare').

In [ ]:
train.loc[
    train["Title"]=='Master',
                "Title"
    ]= 1
train.loc[
    train["Title"]=='Miss',
                "Title"
    ]= 2
train.loc[
    train["Title"]=='Mr',
                "Title"
    ]= 3
train.loc[
    train["Title"]=='Mrs',
                "Title"
    ]= 4
train.loc[
    train["Title"]=='Rare',
                "Title"
    ]= 5

test.loc[
    test["Title"]=='Master',
                "Title"
    ]= 1
test.loc[
    test["Title"]=='Miss',
                "Title"
    ]= 2
test.loc[
    test["Title"]=='Mr',
                "Title"
    ]= 3
test.loc[
    test["Title"]=='Mrs',
                "Title"
    ]= 4
test.loc[
    test["Title"]=='Rare',
                "Title"
    ]= 5

5.3 Remplacer les titres manquant par 0, et attribuer à la colonne le type entier.

In [ ]:
 train['Title'].fillna(0)
test['Title'].fillna(0)

5.4 Attribuer une valeur numérique aux 4 catégories de la variable Fare (question 3.6)

In [ ]:
train['CategoricalFare'] = pd.qcut(train['Fare'],4, labels=[0, 1, 2, 3])
test['CategoricalFare'] = pd.qcut(train['Fare'],4, labels=[0, 1, 2, 3])

5.5 Attribuer une valeur numérique aux 5 catégories de la variable Age (question 3.7)

In [ ]:
train['CategoricalAge'] = pd.qcut(train['Age'], 5, labels=[0, 1, 2, 3, 4])
test['CategoricalAge'] = pd.qcut(test['Age'], 5, labels=[0, 1, 2, 3, 4])

5.6 Attibuer une valeur numérique au Port d'embarquement (Embarked)

In [ ]:
train.loc[
    train["Embarked"]=='C',
                "Embarked"
    ]= 1
train.loc[
    train["Embarked"]=='Q',
                "Embarked"
    ]= 2
train.loc[
    train["Embarked"]=='S',
                "Embarked"
    ]= 3

test.loc[
    test["Embarked"]=='C',
                "Embarked"
    ]= 1
test.loc[
    test["Embarked"]=='Q',
                "Embarked"
    ]= 2
test.loc[
    test["Embarked"]=='S',
                "Embarked"
    ]= 3

5.7 Supprimer les features inutiles

In [ ]:
train = train.drop(['Ticket', 'Cabin', 'Name'], axis=1)
test = test.drop(['Ticket', 'Cabin', 'Name'], axis=1)

5.8 Afficher les infos pour les deux datasets

In [ ]:
train.info()
test.info()

# Sauver les deux datasets dans des fichier csv. Eviter d'écrire un index (n° de ligne)

In [ ]:
train.to_csv(index=False)
test.to_csv(index=False)

##### Question : Sur combien de questions avez-vous utilisé les conseils ?